In [2]:
import numpy as np
import pandas as pd
dict1= {
    "name":['manasi','aniket','sakshi'],
    "marks":[90,98,99]
}
df=pd.DataFrame(dict1)
df

     name  marks
0  manasi     90
1  aniket     98
2  sakshi     99

In [3]:
df.head(2)

     name  marks
0  manasi     90
1  aniket     98

In [4]:
df.tail(2)

     name  marks
1  aniket     98
2  sakshi     99